saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/NXP.MK64F12_DFP.11.0.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <name>MK64F12_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for MK64F12</description>
  <url>http://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version="11.0.0">NXP CMSIS packs based on MCUXpresso SDK 2.5.0</release>
    <release version="10.0.4">NXP CMSIS packs based on MCUXpresso SDK 2.4.2</release>
    <release version="10.0.3">A problem with missing components from some example the projects were dependent on was fixed (KEX-4241); Incorrect path to linked libraries were fixed: a pack version was a static part of the path and hadn’t worked for pack versions other than v10.0.0 (KEX-4373); A problem with incorrectly defined XIP_BOOT_HEADER_ENABLE, XIP_BOOT_HEADER_DCD_ENABLE and XIP_EXTERNAL_FLASH preprocessor symbols was fixed (KEX-4553); Missing flash algorithms for MK27, MK28, LPC802 and LPC804 device family packs were added (KEX-4659).</release>
    <release version="10.0.2">NXP CMSIS packs based on MCUXpresso SDK 2.4.0</release>
    <release version="10.0.1">NXP CMSIS packs based on MCUXpresso SDK 2.3.1</release>
    <release version="10.0.0">NXP CMSIS packs with updated Clear BSD license, based on MCUXpresso SDK 2.3.0. NXP CMSIS pack will maintain independent versioning starting with 10.0.0</release>
    <release version="2.3.0">NXP MCUXpresso SDK 2.3.0 CMSIS packs with updated Clear BSD license</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <taxonomy>
    <description Cclass="Device" Cgroup="SDK Project Template">NXP MCUXpresso SDK RTE Device Project Template</description>
    <description Cclass="Device" Cgroup="SDK Drivers">NXP MCUXpresso SDK Peripheral Drivers</description>
    <description Cclass="CMSIS Driver">NXP MCUXpresso SDK Peripheral CMSIS Drivers</description>
    <description Cclass="Device" Cgroup="SDK Utilities">NXP MCUXpresso SDK Utilities</description>
    <description Cclass="Board Support" Cgroup="SDK Project Template">NXP MCUXpresso SDK Project Template</description>
    <description Cclass="Device" Cgroup="Startup">NXP MCUXpresso SDK Start up</description>
  </taxonomy>
  <devices>
    <family Dfamily="MK64F12" Dvendor="NXP:11">
      <description>The Kinetis K series MCU portfolio offers the broadest selection of pin, peripheral- and software-compatible MCU families based on the ARM® Cortex®-M4 core. The Kinetis K64 120 MHz MCUs feature:IEEE® 1588 Ethernet MCUs. Optimization for applications requiring large memory densities and low-power processing efficiency. Crystal-less USB design for reduced system cost and board space. The comprehensive enablement and scalability of the Kinetis portfolio.</description>
      <device Dname="MK64FN1M0xxx12">
        <processor Dcore="Cortex-M4" Dfpu="SP_FPU" Dendian="Little-endian" Dclock="120000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MK64FN1M0xxx12_flash.icf"/>
        </environment>
        <memory name="FLEX_RAM" start="0x14000000" size="0x1000" access="rw"/>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x100000" access="rx" default="1" startup="1"/>
        <memory name="SRAM_LOWER" start="0x1fff0000" size="0x010000" access="rw"/>
        <memory name="SRAM_UPPER" start="0x20000000" size="0x030000" access="rw" default="1"/>
        <algorithm name="arm/MK_P1M0.FLM" start="0x00000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
        <debug svd="MK64F12.xml"/>
        <variant Dvariant="MK64FN1M0VDC12">
          <compile header="fsl_device_registers.h" define="CPU_MK64FN1M0VDC12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK64FN1M0VDC12/MK64FN1M0xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK64FN1M0VLL12">
          <compile header="fsl_device_registers.h" define="CPU_MK64FN1M0VLL12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK64FN1M0VLL12/MK64FN1M0xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK64FN1M0VLQ12">
          <compile header="fsl_device_registers.h" define="CPU_MK64FN1M0VLQ12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK64FN1M0VLQ12/MK64FN1M0xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK64FN1M0VMD12">
          <compile header="fsl_device_registers.h" define="CPU_MK64FN1M0VMD12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK64FN1M0VMD12/MK64FN1M0xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK64FN1M0CAJ12">
          <compile header="fsl_device_registers.h" define="CPU_MK64FN1M0CAJ12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK64FN1M0CAJ12/MK64FN1M0xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
      <device Dname="MK64FX512xxx12">
        <processor Dcore="Cortex-M4" Dfpu="SP_FPU" Dendian="Little-endian" Dclock="120000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MK64FX512xxx12_flash.icf"/>
        </environment>
        <memory name="FLEX_NVM" start="0x10000000" size="0x020000" access="rx"/>
        <memory name="FLEX_RAM" start="0x14000000" size="0x1000" access="rw"/>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x080000" access="rx" default="1" startup="1"/>
        <memory name="SRAM_LOWER" start="0x1fff0000" size="0x010000" access="rw"/>
        <memory name="SRAM_UPPER" start="0x20000000" size="0x020000" access="rw" default="1"/>
        <algorithm name="arm/MK_P512X.FLM" start="0x00000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
        <algorithm name="arm/MKD128_4KB_SECTOR.FLM" start="0x10000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
        <debug svd="MK64F12.xml"/>
        <variant Dvariant="MK64FX512VDC12">
          <compile header="fsl_device_registers.h" define="CPU_MK64FX512VDC12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK64FX512VDC12/MK64FX512xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK64FX512VLL12">
          <compile header="fsl_device_registers.h" define="CPU_MK64FX512VLL12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK64FX512VLL12/MK64FX512xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK64FX512VLQ12">
          <compile header="fsl_device_registers.h" define="CPU_MK64FX512VLQ12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK64FX512VLQ12/MK64FX512xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK64FX512VMD12">
          <compile header="fsl_device_registers.h" define="CPU_MK64FX512VMD12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK64FX512VMD12/MK64FX512xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="cond_MCUXpressoConfigTools">
      <accept Dname="MK64FN1M0???12" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12" Dvendor="NXP:11"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="device.MK64F12_AND_driver.dmamux_AND_driver.edma">
      <accept Dname="MK64FN1M0???12" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
    </condition>
    <condition id="device.MK64F12_AND_driver.edma_AND_driver.sai">
      <accept Dname="MK64FN1M0???12" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="sai"/>
    </condition>
    <condition id="device.MK64F12_AND_CMSIS_Driver_Include.Ethernet_AND_CMSIS_Driver_Include.Ethernet_MAC_AND_CMSIS_Driver_Include.Ethernet_PHY_AND_RTE_Device_AND_driver.enet_AND_driver.phyksz8041">
      <accept Dname="MK64FN1M0???12" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="phyksz8041"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="enet"/>
      <require Cclass="CMSIS Driver" Cgroup="Ethernet" Capiversion="2.1.0"/>
      <require Cclass="CMSIS Driver" Cgroup="Ethernet" Capiversion="2.1.0"/>
      <require Cclass="CMSIS Driver" Cgroup="Ethernet" Capiversion="2.1.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MK64F12_AND_driver.uart">
      <accept Dname="MK64FN1M0???12" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
    </condition>
    <condition id="device.MK64F12">
      <accept Dname="MK64FN1M0???12" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12" Dvendor="NXP:11"/>
    </condition>
