saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/NXP.MK64F12_DFP.11.0.0.pdsc
    <condition id="device.MK64F12_AND_core.cm4f">
      <accept Dname="MK64FN1M0???12" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12" Dvendor="NXP:11"/>
      <require Dcore="Cortex-M4" Dfpu="SP_FPU"/>
    </condition>
    <condition id="device.MK64F12_AND_utility.debug_console">
      <accept Dname="MK64FN1M0???12" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
    </condition>
    <condition id="device.MK64F12_AND_driver.common">
      <accept Dname="MK64FN1M0???12" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.MK64F12_AND_component.lists_AND_utility.debug_console">
      <accept Dname="MK64FN1M0???12" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
    </condition>
    <condition id="device.MK64F12_AND_component.serial_manager_AND_driver.common">
      <accept Dname="MK64FN1M0???12" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.MK64F12_AND_CMSIS_Driver_Include.I2C">
      <accept Dname="MK64FN1M0???12" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12" Dvendor="NXP:11"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.3.0"/>
    </condition>
    <condition id="device.MK64F12_AND_CMSIS_Driver_Include.I2C_AND_RTE_Device_AND_driver.i2c_edma">
      <accept Dname="MK64FN1M0???12" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_edma"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MK64F12_AND_CMSIS_Driver_Include.SPI_AND_RTE_Device_AND_driver.dspi_edma">
      <accept Dname="MK64FN1M0???12" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dspi_edma"/>
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.2.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MK64F12_AND_CMSIS_Driver_Include.USART_AND_RTE_Device_AND_driver.uart_edma">
      <accept Dname="MK64FN1M0???12" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart_edma"/>
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MK64F12_AND_driver.dspi_AND_driver.edma">
      <accept Dname="MK64FN1M0???12" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dspi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="device.MK64F12_AND_driver.edma_AND_driver.i2c">
      <accept Dname="MK64FN1M0???12" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="device.MK64F12_AND_driver.edma_AND_driver.uart">
      <accept Dname="MK64FN1M0???12" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="device.MK64F12_AND_driver.common_AND_driver.dmamux">
      <accept Dname="MK64FN1M0???12" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.MK64F12_AND_device.MK64F12_CMSIS_AND_driver.clock">
      <accept Dname="MK64FN1M0???12" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="Startup" Csub="MK64F12_startup"/>
    </condition>
    <condition id="device.MK64F12_AND_component.serial_manager_uart_AND_component.uart_adapter_AND_device.MK64F12_startup_AND_driver.adc16_AND_driver.clock_AND_driver.common_AND_driver.dspi_AND_driver.gpio_AND_driver.i2c_AND_driver.port_AND_driver.rtc_AND_driver.smc_AND_driver.uart_AND_utility.debug_console">
      <accept Dname="MK64FN1M0???12" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="port"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="smc"/>
      <require Cclass="Device" Cgroup="Startup" Csub="MK64F12_startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rtc"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="adc"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dspi"/>
    </condition>
    <condition id="device.MK64F12_AND_CMSIS_Include_core_cm4">
      <accept Dname="MK64FN1M0???12" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12" Dvendor="NXP:11"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
